<script setup>
import '{scss}/modules/index.scss';

import Hero from "{components}/Hero.vue";
import ProductList from "{modules}/index/components/ProductList.vue";
</script>

<template>
  <main class="index main">
    <Hero class="container-large">
      <div class="index__hero">
        <h2 class="index__title">MountCode<br>Технологии доступные каждому!</h2>
        <div class="index__description">
          <p>Наша студия - это творческий коллектив опытных программистов с глубоким пониманием современных технологий!</p>
          <p>
            Мы специализируемся на создании инновационных программных решений, плагинов и модификаций, которые поддерживают и улучшают функциональность ваших приложений.
            <br>
            Мы стремимся к высшему качеству и индивидуальному подходу к каждому проекту. Наш опыт включает в себя разработку программного обеспечения для различных отраслей, начиная от веб-приложений и заканчивая модификациями для игровых проектов.
            <br>
            Мы гордимся своей способностью адаптироваться к изменяющимся требованиям рынка и предоставлять клиентам инновационные решения.
            <br>
            Наша цель - не просто разрабатывать программное обеспечение, а создавать инструменты, которые действительно делают жизнь пользователей легче и более продуктивной.
          </p>
        </div>
      </div>
    </Hero>
    <ProductList class="index__products container-small"/>
  </main>
</template>